#ifndef UART_H
#define	UART_H

//******************************************************************************
//  Секция включения заголовочных файлов
//******************************************************************************
#include <stdint.h>
#include <stdbool.h>

//******************************************************************************
//  Секция определения макросов
//******************************************************************************
/* Кол-во аппаратных UART */
#define NUART				2

//******************************************************************************
//  Секция объявления типов
//******************************************************************************
/* Имена таймеров */
typedef enum
{
	nUART1 = 0,
	nUART2,
}tUART;

/* Контроль четности */
typedef enum
{
    pNONE,
    pEVEN,
    pODD,
}tUART_Parity;
/* Кол-во стоп-бит */
typedef enum
{
    sbONE,
    sbTWO,
}tUART_StopBit;
/* Аппаратное управление потоком (не реализовано) */
typedef enum
{
    fcNONE,
    fcRTS,
    fcRTS_CTS,
    fBCLK,
}tUART_FlowControl;

typedef struct
{
    uint32_t baudrate;
    uint8_t data_bits;
    tUART_Parity parity;
    tUART_StopBit stop_bit;
    tUART_FlowControl flow_ctrl;
//    bool tx_only;
}tUART_Cfg;

//******************************************************************************
//  Секция описания глобальных переменных
//******************************************************************************

//******************************************************************************
//  Секция прототипов глобальных функций
//******************************************************************************
void UART_Init(tUART name, const tUART_Cfg *cfg);

//******************************************************************************
//  Конец файла
//******************************************************************************
#endif	// UART_H
